<template>
    <v-sheet v-designer.true>
        <v-card>
            <v-card-title>
                Конструктор сайтов на VueJs без VendorLock
            </v-card-title>
            <v-card-item class="text-justify">
                Предоставляет пользователям свободу выбора хостинга и других услуг,
                а также обеспечивает быстрое создание сайтов благодаря производительности VueJs.
                Конструктор сайтов прост в использовании, гибок и масштабируем, имеет адаптивный дизайн,
                дает полный контроль над кодом и имеет большое сообщество разработчиков, которые
                могут поддерживать пользователей. Кроме того, VueJs удобно интегрируется с другими
                технологиями и инструментами, что позволяет пользователям создавать более сложные и интерактивные сайты.
            </v-card-item>
            <v-card-item>
                <VImg src="shortDemo2.gif"></VImg>
            </v-card-item>
        </v-card>
        <v-list>
            <v-list-subheader>
                Преимущества
            </v-list-subheader>
            <v-list-item class="text-left">
                Отсутствие VendorLock - возможность свободно выбирать хостинг и другие услуги, не ограничивая себя выбором нашей платформы.
            </v-list-item>
            <v-list-item class="text-left">
                Использование VueJs обеспечивает быстрое и производительное создание сайтов, что позволяет сократить время на разработку.
            </v-list-item>
            <v-list-item class="text-left">
                Простота использования - наш конструктор сайтов прост в использовании, даже если Вы не имеете опыта веб-разработки.
            </v-list-item>
            <v-list-item class="text-left">
                Адаптивность - благодаря использованию VueJs, созданные сайты имеют адаптивный дизайн, что позволяет корректно отображаться на любых устройствах, включая мобильные телефоны и планшеты.
            </v-list-item>
            <v-list-item class="text-left">
                Контроль над кодом - пользователи имеют полный контроль над созданным кодом, что позволяет вносить изменения в любой момент и при необходимости быстро устранять ошибки.
            </v-list-item>
            <v-list-item class="text-left">
                Большое сообщество - благодаря популярности VueJs, есть большое сообщество разработчиков, которые могут поддерживать пользователей, отвечать на вопросы и делиться опытом.
            </v-list-item>
            <v-list-item class="text-left"></v-list-item>
        </v-list>
    </v-sheet>
</template>
<script>
export default {
    name: 'Home',
    components: {},
    data: () => ({}),
    methods: {
        onClick() {
            alert('Hello !');
        }

    }
};
</script>
<style lang="scss">
.redText {
    color: red;
}
</style>
